blog/local.org
# -*- org-html-htmlize-output-type: nil; org-html-postamble: nil; -*-

#+HTML_HEAD_EXTRA: <style>.meta { opacity: 0.75; margin-left: 1em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; padding: 0em 1em; margin-left: 1em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head { cursor: pointer; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head > p:first-child { font-variant: small-caps; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-body { max-height: 0em; transform: scaleY(0); transition: transform 0.3s; transform-origin: top; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-body > p:first-child { margin-top: 0; padding-top: 0.5em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head > p:last-child { margin-bottom: 0; padding-bottom: 0.5em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-body:hover { max-height: 10000em; transform: scaleY(1); }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head:hover + .accordion-body { max-height: 10000em; transform: scaleY(1); }</style>
#+HTML_HEAD_EXTRA: <style>.trigger { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; padding: 0.5em 1em; margin-left: 1em; }</style>
#+HTML_HEAD_EXTRA: <style>.trigger:before { content: 'Trigger'; font-variant: small-caps; }</style>

* Prior knowledge

Flawless concurrent programs are legendarily hard. Some race condition, deadlock or resource starvation creeps in and your program no longer does what you expect.

Have you ever traced a bug only to find it originates with "impossible" data in the database? A negative age, a payment pointing to a missing user, etc. Such occasions renew our appreciation for foreign key constraints, check constraints and other strong checks for data integrity.

Many best practices guides also advise that global mutable state is to be strenuously avoided. For example, [[https://softwareengineering.stackexchange.com/questions/148108/why-is-global-state-so-evil][here]] or [[http://wiki.c2.com/?GlobalVariablesAreBad][here]].

I claim that there is an underlying commonality to these examples. In each case, we encounter errors because we must perform "global" reasoning. When working with concurrency, many systems require us to try to mentally explore the space of all possible execution interleavings. When ensuring that data meets integrity constraints, we are required to think through all insert and update paths hitting the database and make sure they conform to our rules in all cases. Working with global mutable state successfully requires us to know which other functions have and haven't been called before this function.

* Global vs local reasoning

Local reasoning is called for when we can infer the correctness of a piece of code only from its local context---e.g. determining the correctness of function only by examining its body. When we must understand some operational context beyond the immediate code (e.g. which functions have been previously executed, what data is in the database), that's global reasoning (Though, of course, there's really a spectrum between local and global reasoning depending on how much context must be understood.).

#+begin_accordion
#+begin_accordion-head
Practice

What other code do you need to see to understand the behavior of the following?

#+begin_src js
function add(left: number, right: number): number {
  return left + right;
}
#+end_src
#+end_accordion-head
#+begin_accordion-body
None. It's a prime example of local reasoning. There are no side effects---it's a pure function of its arguments.
#+end_accordion-body
#+end_accordion

#+begin_accordion
#+begin_accordion-head
Practice

What other code do you need to see to understand the behavior of the following?
#+begin_src js
function conditionalIncrement(num: number): number {
  return this.increment ? num + 1 : num;
}
#+end_src
#+end_accordion-head
#+begin_accordion-body
At a minimum, you need to understand all other code that interacts with ~this.increment~. This is global reasoning.
#+end_accordion-body
#+end_accordion

* Goals

- Learn the distinction between global and local reasoning
  - You'll know you're on the way when you can easily recall the definition and can bring examples to mind
  - Check this goal off when you can generate and apply novel ways of transforming problems of global reasoning into problems of local reasoning
- Learn some techniques for transforming problems of global reasoning into problems of local reasoning

* How

** Smart constructors over validations

We've already seen some examples of this next technique though we phrased it in terms of "make illegal state unrepresentable" rather than global versus local reasoning.

#+begin_src js
/* This will be shared across both implementations: */
const slugRegex = /^[a-z-]+$/;

/* This is, arguably, standard practice. We declare a class which declares its validations: */
class SlugBad {
  slug: string;
  constructor(str: string) {
    this.slug = str;
    return this;
  }
  validateSlug(): boolean {
    return slugRegex.test(this.slug);
  }
}

/* But it's trivial to have data which doesn't satisfy the validations: */
console.log(new SlugBad('ABC'));

/* Instead, we embed the validation in the constructor: */
class SlugGood {
  raw: string;
  constructor(str: string): SlugGood {
    if (slugRegex.test(str)) {
      this.raw = str;
      return this;
    } else {
      throw new TypeError('Not a valid slug');
    }
  }
  static make(str: string): ?SlugGood {
    try {
      return new SlugGood(str);
    } catch (e) {
      if (e instanceof TypeError) {
        return null;
      } else {
        throw e;
      }
    }
  }
}

console.log(SlugGood.make('abc'));
#+end_src

With the second approach, the only way to construct a ~SlugGood~ is through a constructor which performs the validation (these are sometimes called "smart constructors"). Thus, we can be assured that if we have a ~SlugGood~ the underlying data satisfies our criteria.

To be explicit, this is a useful shift from a problem of global reasoning to a problem of local reasoning. In the first setup, if we have a ~SlugBad~ and we need to be sure the slug really is valid, we have two choices:
- We can validate again (and again and again) at each use site which leads to a proliferation of error handling code and duplication of possibly expensive checks.
- We can try to trace the ~SlugBad~ to its point of origin and ensure that validation was performed somewhere along the way.
The latter is a clear demand for global reasoning and thus very hard to execute flawlessly. If we rely on it, we'll almost surely forget to validate along some code paths some of the time.

~SlugGood~ to the rescue. Why does this work? With ~SlugBad~ we have an implicit piece of state---whether the validation has been performed---which we must track manually. ~SlugGood~ makes this piece of state explicit in the type system via the transition from ~string~ to ~SlugGood~ and pushes the burden off onto our type checker. We'll see this is a generally applicable pattern in solving problems of global reasoning (make the type checker do the global reasoning instead by making something explicit).

