blog/local.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-06 Fri 10:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eric Easley" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeda1e9f">1. Prior knowledge</a></li>
<li><a href="#orge3f49b5">2. Global vs local reasoning</a></li>
<li><a href="#org4c58198">3. Goals</a></li>
<li><a href="#org2df86c3">4. How</a>
<ul>
<li><a href="#orgd0d81c4">4.1. Smart constructors over validations</a></li>
<li><a href="#org701c4dc">4.2. Wrappers</a></li>
<li><a href="#org8561252">4.3. Witness</a>
<ul>
<li><a href="#org322db36">4.3.1. Extension</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6be0c90">5. Why</a>
<ul>
<li><a href="#orgbc98c46">5.1. Code quality</a>
<ul>
<li><a href="#orgfb26127">5.1.1. Documentation</a></li>
<li><a href="#org4077151">5.1.2. Reliability</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgeda1e9f" class="outline-2">
<h2 id="orgeda1e9f"><span class="section-number-2">1</span> Prior knowledge</h2>
<div class="outline-text-2" id="text-1">
<p>
Flawless concurrent programs are legendarily hard. Some race condition, deadlock or resource starvation creeps in and your program no longer does what you expect.
</p>

<p>
Have you ever traced a bug only to find it originates with "impossible" data in the database? A negative age, a payment pointing to a missing user, etc. Such occasions renew our appreciation for foreign key constraints, check constraints and other strong checks for data integrity.
</p>

<p>
Many best practices guides also advise that global mutable state is to be strenuously avoided. For example, <a href="https://softwareengineering.stackexchange.com/questions/148108/why-is-global-state-so-evil">here</a> or <a href="http://wiki.c2.com/?GlobalVariablesAreBad">here</a>.
</p>

<p>
I claim that there is an underlying commonality to these examples. In each case, we encounter errors because we must perform "global" reasoning. When working with concurrency, many systems require us to try to mentally explore the space of all possible execution interleavings. When ensuring that data meets integrity constraints, we are required to think through all insert and update paths hitting the database and make sure they conform to our rules in all cases. Working with global mutable state successfully requires us to know which other functions have and haven't been called before this function.
</p>
</div>
</div>

<div id="outline-container-orge3f49b5" class="outline-2">
<h2 id="orge3f49b5"><span class="section-number-2">2</span> Global vs local reasoning</h2>
<div class="outline-text-2" id="text-2">
<p>
Local reasoning is called for when we can infer the correctness of a piece of code only from its local context&#x2014;e.g. determining the correctness of function only by examining its body. When we must understand some operational context beyond the immediate code (e.g. which functions have been previously executed, what data is in the database), that's global reasoning (Though, of course, there's really a spectrum between local and global reasoning depending on how much context must be understood.).
</p>

<div class="accordion">
<div class="accordion-head">
<p>
Practice
</p>

<p>
What other code do you need to see to understand the behavior of the following?
</p>

<div class="org-src-container">
<pre><code class="src src-js">function add(left: number, right: number): number {
  return left + right;
}
</code></pre>
</div>

</div>
<div class="accordion-body">
<p>
None. It's a prime example of local reasoning. There are no side effects&#x2014;it's a pure function of its arguments.
</p>

</div>

</div>

<div class="accordion">
<div class="accordion-head">
<p>
Practice
</p>

<p>
What other code do you need to see to understand the behavior of the following?
</p>
<div class="org-src-container">
<pre><code class="src src-js">function conditionalIncrement(num: number): number {
  return this.increment ? num + 1 : num;
}
</code></pre>
</div>

</div>
<div class="accordion-body">
<p>
At a minimum, you need to understand all other code that interacts with <code>this.increment</code>. This is global reasoning.
</p>

</div>

</div>
</div>
</div>

<div id="outline-container-org4c58198" class="outline-2">
<h2 id="org4c58198"><span class="section-number-2">3</span> Goals</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Learn the distinction between global and local reasoning
<ul class="org-ul">
<li>You'll know you're on the way when you can easily recall the definition and can bring examples to mind</li>
<li>Check this goal off when you can generate and apply novel ways of transforming problems of global reasoning into problems of local reasoning</li>
</ul></li>
<li>Learn some techniques for transforming problems of global reasoning into problems of local reasoning</li>
</ul>
</div>
</div>

<div id="outline-container-org2df86c3" class="outline-2">
<h2 id="org2df86c3"><span class="section-number-2">4</span> How</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd0d81c4" class="outline-3">
<h3 id="orgd0d81c4"><span class="section-number-3">4.1</span> Smart constructors over validations</h3>
<div class="outline-text-3" id="text-4-1">
<p>
We've already seen some examples of this next technique though we phrased it in terms of "make illegal state unrepresentable" rather than global versus local reasoning.
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* This will be shared across both implementations: */
const slugRegex = /^[a-z-]+$/;

/* This is, arguably, standard practice. We declare a class which declares its validations: */
class SlugBad {
  slug: string;
  constructor(str: string) {
    this.slug = str;
    return this;
  }
  validateSlug(): boolean {
    return slugRegex.test(this.slug);
  }
}

/* But it's trivial to have data which doesn't satisfy the validations: */
console.log(new SlugBad('ABC'));

/* Instead, we embed the validation in the constructor: */
class SlugGood {
  raw: string;
  constructor(str: string): SlugGood {
    if (slugRegex.test(str)) {
      this.raw = str;
      return this;
    } else {
      throw new TypeError('Not a valid slug');
    }
  }
  static make(str: string): ?SlugGood {
    try {
      return new SlugGood(str);
    } catch (e) {
      if (e instanceof TypeError) {
        return null;
      } else {
        throw e;
      }
    }
  }
}

console.log(SlugGood.make('abc'));
</code></pre>
</div>

<p>
With the second approach, the only way to construct a <code>SlugGood</code> is through a constructor which performs the validation (these are sometimes called "smart constructors"). Thus, we can be assured that if we have a <code>SlugGood</code> the underlying data satisfies our criteria.
</p>

<p>
To be explicit, this is a useful shift from a problem of global reasoning to a problem of local reasoning. In the first setup, if we have a <code>SlugBad</code> and we need to be sure the slug really is valid, we have two choices:
</p>
<ul class="org-ul">
<li>We can validate again (and again and again) at each use site which leads to a proliferation of error handling code and duplication of possibly expensive checks.</li>
<li>We can try to trace the <code>SlugBad</code> to its point of origin and ensure that validation was performed somewhere along the way.</li>
</ul>
<p>
The latter is a clear demand for global reasoning and thus very hard to execute flawlessly. If we rely on it, we'll almost surely forget to validate along some code paths some of the time.
</p>

<p>
<code>SlugGood</code> to the rescue. Why does this work? With <code>SlugBad</code> we have an implicit piece of state&#x2014;whether the validation has been performed&#x2014;which we must track manually. <code>SlugGood</code> makes this piece of state explicit in the type system via the transition from <code>string</code> to <code>SlugGood</code> and pushes the burden off onto our type checker. We'll see this is a generally applicable pattern in solving problems of global reasoning (make the type checker do the global reasoning instead by making something explicit).
</p>
</div>
</div>
