blog/local.org
** Wrappers

Here's another very simple technique that can pay off well. The basic technique is just to "wrap" types to reflect semantics.

#+begin_src js
class Name {
  name: string;
  constructor(str: string) {
    this.name = str;
    return this;
  }
}
#+end_src

Why would this be useful? Aside from the obvious and relatively small benefit of ensuring that we don't accidentally mix up various strings, we can apply this technique in more interesting scenarios. Suppose we have two versions of course slug on the backend (the backend wants to change the serialization format, for example)---the original version and the one we're trying to migrate to. During the migration, we'll also end up with two sets of functions for interacting with these APIs:

#+begin_src js
/* Placeholder */
const _: any = undefined;

type CourseDescription = {
  // ...
};

function authoringUpdateCourseBad(slug: string, course: CourseDescription): void {
  return _;
}

function loadCourseDescriptionBad(slug: string): CourseDescription {
  return _;
}

/* And on and on for all functionality depending on these APIs. */

function authoringUpdateCourseV2Bad(slug: string, course: CourseDescription): void {
  return _;
}

function loadCourseDescriptionV2Bad(slug: string): void {
  return _;
}

/* And on and on for all functionality depending on these APIs. */
#+end_src

But what happens when the backend wants to finally remove support for the old, deprecated slug format? How can we be sure we no longer depend on it? The only way is to search through our whole code base and hope we find all use sites. This is simultaneously tedious and error-prone.

A better approach might look like:

#+begin_src js
/* Placeholder */
const _: any = undefined;

type CourseDescription = {
  // ...
};
class Slug {
  slug: string;
  constructor(str: string) {
    this.slug = str;
    return this;
  }
}
class SlugV2 {
  slug: string;
  constructor(str: string) {
    this.slug = str;
    return this;
  }
}

function authoringUpdateCourseGood(slug: Slug, course: CourseDescription): void {
  return _;
}

function loadCourseDescriptionGood(slug: Slug): void {
  return _;
}

function authoringUpdateCourseV2Good(slug: SlugV2, course: CourseDescription): void {
  return _;
}

function loadCourseDescriptionV2Good(slug: SlugV2): void {
  return _;
}
#+end_src

Now, the problem of removing dependence on the old slug format is trivial. We simply delete the original ~Slug~ and whatever doesn't compile must go.

Again, we see that we solved a problem of global reasoning by making implicit information explicit in the type system. This time we made our slug version explicit my having a separate type for each version (even though the classes don't do anything interesting on their own!).

