blog/local.html

<div id="outline-container-org701c4dc" class="outline-3">
<h3 id="org701c4dc"><span class="section-number-3">4.2</span> Wrappers</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Here's another very simple technique that can pay off well. The basic technique is just to "wrap" types to reflect semantics.
</p>

<div class="org-src-container">
<pre><code class="src src-js">class Name {
  name: string;
  constructor(str: string) {
    this.name = str;
    return this;
  }
}
</code></pre>
</div>

<p>
Why would this be useful? Aside from the obvious and relatively small benefit of ensuring that we don't accidentally mix up various strings, we can apply this technique in more interesting scenarios. Suppose we have two versions of course slug on the backend (the backend wants to change the serialization format, for example)&#x2014;the original version and the one we're trying to migrate to. During the migration, we'll also end up with two sets of functions for interacting with these APIs:
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* Placeholder */
const _: any = undefined;

type CourseDescription = {
  // ...
};

function authoringUpdateCourseBad(slug: string, course: CourseDescription): void {
  return _;
}

function loadCourseDescriptionBad(slug: string): CourseDescription {
  return _;
}

/* And on and on for all functionality depending on these APIs. */

function authoringUpdateCourseV2Bad(slug: string, course: CourseDescription): void {
  return _;
}

function loadCourseDescriptionV2Bad(slug: string): void {
  return _;
}

/* And on and on for all functionality depending on these APIs. */
</code></pre>
</div>

<p>
But what happens when the backend wants to finally remove support for the old, deprecated slug format? How can we be sure we no longer depend on it? The only way is to search through our whole code base and hope we find all use sites. This is simultaneously tedious and error-prone.
</p>

<p>
A better approach might look like:
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* Placeholder */
const _: any = undefined;

type CourseDescription = {
  // ...
};
class Slug {
  slug: string;
  constructor(str: string) {
    this.slug = str;
    return this;
  }
}
class SlugV2 {
  slug: string;
  constructor(str: string) {
    this.slug = str;
    return this;
  }
}

function authoringUpdateCourseGood(slug: Slug, course: CourseDescription): void {
  return _;
}

function loadCourseDescriptionGood(slug: Slug): void {
  return _;
}

function authoringUpdateCourseV2Good(slug: SlugV2, course: CourseDescription): void {
  return _;
}

function loadCourseDescriptionV2Good(slug: SlugV2): void {
  return _;
}
</code></pre>
</div>

<p>
Now, the problem of removing dependence on the old slug format is trivial. We simply delete the original <code>Slug</code> and whatever doesn't compile must go.
</p>

<p>
Again, we see that we solved a problem of global reasoning by making implicit information explicit in the type system. This time we made our slug version explicit my having a separate type for each version (even though the classes don't do anything interesting on their own!).
</p>
</div>
</div>
