blog/local.org
** Witness

Sometimes the implicit information we want to make explicit isn't "attached" to any type. In this case, we will have a simple value which functions as a "witness" that a side effect has been performed. A very simple example:

#+begin_src js
/* Placeholder */
const _: any = undefined;

/* Perform some effectful operation (e.g. writing to the database, sending an email): */
function doBrilligBad(slithyId: number): void {
  _;
}
/* Some follow-up functionality: */
function mustHaveBrilliggedBad(): void {
  _;
}
/* The problem here is that there's no guarantee we'll /actually/ perform the prerequisite action. Especially in cases where we don't have the good fortune of having the function name explicitly declare it's preconditions.

Instead: */

class HaveBrilligged {
  function doBrilligGood(slithyId: number): void {
    _;
  }
  constructor(slithyId: number): HaveBrilligged {
    doBrilligGood(slithyId);
    return this;
  }
}

function mustHaveBrilliggedGood(haveBrilligged: HaveBrilligged): void {
  _;
}
#+end_src

The second approach makes our ~brillig~ requirement explicit. We can no longer forget it. Any caller of ~mustHaveBrilliggedGood~ has to have a ~HaveBrilligged~ at hand and the only constructor for that calls ~doBrilligGood~. So we're pushing our global burden (all callers must have performed a prior action) into the type system yet again.

This is much like our smart constructor technique. Except now our constructor is doing a side-effecting operation instead of performing validation. We call the resulting `HaveBrilligged` value a "witness" of the side-effect.

Now for a somewhat more realistic (and, hopefully, motivating) example. Suppose we have a page which expects to often display paid content. We only actually display the paid content inside the page if the user has paid for it. If the user hasn't paid, we instead show them an upsell modal. Here's what that might look like:

#+begin_src js
import React from 'react';

/* Just for convenience. In the real world, we'd use something better. */
type Html = string;
const _: any = undefined;

/* `loadContent` will fail in an ugly way if the user hasn't paid for the content. */
class PaidCourseContentBodyBad extends React.Component<{userId: string, itemId: string}, {itemContent: Html}> {
  loadContent(userId: string, itemId: string): Html {
    return _;
  }
}

class Upsell extends React.Component<{itemId: string}, void> {}

/* This component checks the payment status and picks a component to render accordingly. */
class PaidCourseContentPageBad extends React.Component<{userId: string, itemId: string}, {hasPaid: boolean}> {
  static fetchPaymentStatus(userId: string, itemId: string): boolean {
    return _;
  }
  setPaymentStatus(userId: string, itemId: string): void {
    this.setState({ hasPaid: PaidCourseContentPageBad.fetchPaymentStatus(userId, itemId) });
  }
  render() {
    const body =
          this.state.hasPaid ?
            <PaidCourseContentBodyBad userId={this.props.userId} itemId={this.props.itemId} /> :
            <Upsell itemId={this.props.itemId} />;
    return <div> {/* ... */} body {/* ... */} </div>;
  }
}
#+end_src

By now, you should be tired of hearing about these problems. ~PaidCourseContentBodyBad~ has an implicit precondition---the check of payment status. We do it successfully in ~PaidCourseContentPageBad~, but the whole point of components is to be reusable. It would be easy to reuse ~PaidCourseContentBodyBad~ in a different context and forget to perform the check.

A solution:

#+begin_src js
type Html = string;
const _: any = undefined;

class HasPaid {
  static fetchPaymentStatus(userId: string, itemId: string): boolean {
    return _;
  }
  constructor(userId: string, itemId: string): HasPaid {
    if (HasPaid.fetchPaymentStatus(userId, itemId)) {
      return this;
    } else {
      throw new TypeError('User hasn\'t paid for content');
    }
  }
  static make(userId: string, itemId: string): ?HasPaid {
    try {
      return new HasPaid(userId, itemId);
    } catch (e) {
      if (e instanceof TypeError) {
        return null;
      } else {
        throw e;
      }
    }
  }
}

class PaidCourseContentBodyGood extends
  React.Component<{userId: string, itemId: string, hasPaid: HasPaid}, {itemContent: Html}> {
  loadContent(userId: string, itemId: string): Html {
    return _;
  }
}

class PaidCourseContentPageGood extends React.Component<{userId: string, itemId: string}, {hasPaid: ?HasPaid}> {
  setPaymentStatus(userId: string, itemId: string): void {
    this.setState({ hasPaid: HasPaid.make(userId, itemId) });
  }
  render() {
    const body =
          this.state.hasPaid ?
           (<PaidCourseContentBodyGood
             userId={this.props.userId}
             itemId={this.props.itemId}
             hasPaid={this.state.hasPaid}
           />) :
           (<Upsell
             itemId={this.props.itemId}
           />);
    return <div> {/* ... */} body {/* ... */} </div>;
  }
}
#+end_src

Hurray! We've again made our requirement explicit via ~HasPaid~ which witnesses our check.

*** Extension

With a little imagination, you can see how we could extend this technique to encode full state machines in a way that ensures we make only valid transitions between states.

* Why

** Code quality

We'll claim the standard benefits: documentation and reuse.

*** Documentation

Following these practices makes type signatures more informative.

Go back and look through our examples. In each case, we have made an implicit requirement explicit. These explicit requirements, captured in code rather than locked in the original author's mind, are much more likely to be noticed and won't leave a some future modifier wondering why the code doesn't do what it looks like it should do.

*** Reliability

A further consequence of the former is that our techniques operate as enforceable documentation. Even if we diligently documented all our preconditions and contextual requirements, we might forget to satisfy them. By encoding them in our types, we require adherence which eliminates all issues arising from accidentally failing to establish the appropriate context.
