blog/local.html

<div id="outline-container-org8561252" class="outline-3">
<h3 id="org8561252"><span class="section-number-3">4.3</span> Witness</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Sometimes the implicit information we want to make explicit isn't "attached" to any type. In this case, we will have a simple value which functions as a "witness" that a side effect has been performed. A very simple example:
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* Placeholder */
const _: any = undefined;

/* Perform some effectful operation (e.g. writing to the database, sending an email): */
function doBrilligBad(slithyId: number): void {
  _;
}
/* Some follow-up functionality: */
function mustHaveBrilliggedBad(): void {
  _;
}
/* The problem here is that there's no guarantee we'll /actually/ perform the prerequisite action. Especially in cases where we don't have the good fortune of having the function name explicitly declare it's preconditions.

Instead: */

class HaveBrilligged {
  function doBrilligGood(slithyId: number): void {
    _;
  }
  constructor(slithyId: number): HaveBrilligged {
    doBrilligGood(slithyId);
    return this;
  }
}

function mustHaveBrilliggedGood(haveBrilligged: HaveBrilligged): void {
  _;
}
</code></pre>
</div>

<p>
The second approach makes our <code>brillig</code> requirement explicit. We can no longer forget it. Any caller of <code>mustHaveBrilliggedGood</code> has to have a <code>HaveBrilligged</code> at hand and the only constructor for that calls <code>doBrilligGood</code>. So we're pushing our global burden (all callers must have performed a prior action) into the type system yet again.
</p>

<p>
This is much like our smart constructor technique. Except now our constructor is doing a side-effecting operation instead of performing validation. We call the resulting `HaveBrilligged` value a "witness" of the side-effect.
</p>

<p>
Now for a somewhat more realistic (and, hopefully, motivating) example. Suppose we have a page which expects to often display paid content. We only actually display the paid content inside the page if the user has paid for it. If the user hasn't paid, we instead show them an upsell modal. Here's what that might look like:
</p>

<div class="org-src-container">
<pre><code class="src src-js">import React from 'react';

/* Just for convenience. In the real world, we'd use something better. */
type Html = string;
const _: any = undefined;

/* `loadContent` will fail in an ugly way if the user hasn't paid for the content. */
class PaidCourseContentBodyBad extends React.Component&lt;{userId: string, itemId: string}, {itemContent: Html}&gt; {
  loadContent(userId: string, itemId: string): Html {
    return _;
  }
}

class Upsell extends React.Component&lt;{itemId: string}, void&gt; {}

/* This component checks the payment status and picks a component to render accordingly. */
class PaidCourseContentPageBad extends React.Component&lt;{userId: string, itemId: string}, {hasPaid: boolean}&gt; {
  static fetchPaymentStatus(userId: string, itemId: string): boolean {
    return _;
  }
  setPaymentStatus(userId: string, itemId: string): void {
    this.setState({ hasPaid: PaidCourseContentPageBad.fetchPaymentStatus(userId, itemId) });
  }
  render() {
    const body =
          this.state.hasPaid ?
            &lt;PaidCourseContentBodyBad userId={this.props.userId} itemId={this.props.itemId} /&gt; :
            &lt;Upsell itemId={this.props.itemId} /&gt;;
    return &lt;div&gt; {/* ... */} body {/* ... */} &lt;/div&gt;;
  }
}
</code></pre>
</div>

<p>
By now, you should be tired of hearing about these problems. <code>PaidCourseContentBodyBad</code> has an implicit precondition&#x2014;the check of payment status. We do it successfully in <code>PaidCourseContentPageBad</code>, but the whole point of components is to be reusable. It would be easy to reuse <code>PaidCourseContentBodyBad</code> in a different context and forget to perform the check.
</p>

<p>
A solution:
</p>

<div class="org-src-container">
<pre><code class="src src-js">type Html = string;
const _: any = undefined;

class HasPaid {
  static fetchPaymentStatus(userId: string, itemId: string): boolean {
    return _;
  }
  constructor(userId: string, itemId: string): HasPaid {
    if (HasPaid.fetchPaymentStatus(userId, itemId)) {
      return this;
    } else {
      throw new TypeError('User hasn\'t paid for content');
    }
  }
  static make(userId: string, itemId: string): ?HasPaid {
    try {
      return new HasPaid(userId, itemId);
    } catch (e) {
      if (e instanceof TypeError) {
        return null;
      } else {
        throw e;
      }
    }
  }
}

class PaidCourseContentBodyGood extends
  React.Component&lt;{userId: string, itemId: string, hasPaid: HasPaid}, {itemContent: Html}&gt; {
  loadContent(userId: string, itemId: string): Html {
    return _;
  }
}

class PaidCourseContentPageGood extends React.Component&lt;{userId: string, itemId: string}, {hasPaid: ?HasPaid}&gt; {
  setPaymentStatus(userId: string, itemId: string): void {
    this.setState({ hasPaid: HasPaid.make(userId, itemId) });
  }
  render() {
    const body =
          this.state.hasPaid ?
           (&lt;PaidCourseContentBodyGood
             userId={this.props.userId}
             itemId={this.props.itemId}
             hasPaid={this.state.hasPaid}
           /&gt;) :
           (&lt;Upsell
             itemId={this.props.itemId}
           /&gt;);
    return &lt;div&gt; {/* ... */} body {/* ... */} &lt;/div&gt;;
  }
}
</code></pre>
</div>

<p>
Hurray! We've again made our requirement explicit via <code>HasPaid</code> which witnesses our check.
</p>
</div>

<div id="outline-container-org322db36" class="outline-4">
<h4 id="org322db36"><span class="section-number-4">4.3.1</span> Extension</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
With a little imagination, you can see how we could extend this technique to encode full state machines in a way that ensures we make only valid transitions between states.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org6be0c90" class="outline-2">
<h2 id="org6be0c90"><span class="section-number-2">5</span> Why</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgbc98c46" class="outline-3">
<h3 id="orgbc98c46"><span class="section-number-3">5.1</span> Code quality</h3>
<div class="outline-text-3" id="text-5-1">
<p>
We'll claim the standard benefits: documentation and reuse.
</p>
</div>

<div id="outline-container-orgfb26127" class="outline-4">
<h4 id="orgfb26127"><span class="section-number-4">5.1.1</span> Documentation</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Following these practices makes type signatures more informative.
</p>

<p>
Go back and look through our examples. In each case, we have made an implicit requirement explicit. These explicit requirements, captured in code rather than locked in the original author's mind, are much more likely to be noticed and won't leave a some future modifier wondering why the code doesn't do what it looks like it should do.
</p>
</div>
</div>

<div id="outline-container-org4077151" class="outline-4">
<h4 id="org4077151"><span class="section-number-4">5.1.2</span> Reliability</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
A further consequence of the former is that our techniques operate as enforceable documentation. Even if we diligently documented all our preconditions and contextual requirements, we might forget to satisfy them. By encoding them in our types, we require adherence which eliminates all issues arising from accidentally failing to establish the appropriate context.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
